In [1]:
import pymongo as mg
import pandas as pd

In [2]:
client = mg.MongoClient(host='mongodb://localhost:27017')

In [3]:
database = client['db_NHIS'] #Database 선택

In [4]:
collection = database['Join Collection NSC2_BND_M20'] # collection 선택

In [5]:
cursor = collection.find({"SICK_SYM1":"I10"})

In [6]:
list_I10 = list(cursor) # casting

In [7]:
df_I10 = pd.DataFrame(list_I10)

In [13]:
df_I10

,MDCARE_STRT_DT,BTH_YYYY,OFIJ_TYPE,MCARE_SUBJ_CD,OPRTN_YN,ED_RC_TOT_AMT
0,20020710,1921LE,0,1,0,7570
1,20020805,1921LE,0,1,0,18160
2,20021017,1921LE,0,1,0,7570
3,20071008,1921LE,0,23,0,14200
4,20040312,1921LE,0,1,0,7310
...,...,...,...,...,...,...
4624,20051220,2005,0,1,0,9050
4625,20050614,2005,0,1,0,9050
4626,20050716,2005,0,1,0,9050
4627,20060123,2005,0,1,0,9380
4628,20101125,2005,0,1,0,12280

### 필요한 컬럼 내역
목표변수 :  MDCARE_STRT_DT(요양개시일자)

설명변수
- MCARE_SUBJ_CD(진료과목코드)
- OFIJ_TYPE(공상 등 구분)
- OPRTN_YN(수술여부)
- ED_RC_TOT_AMT(심결요양급여비용총액)
- BTH_YYYY(출생년도)

In [ ]:
df_I10 = df_I10[['MDCARE_STRT_DT','BTH_YYYY','OFIJ_TYPE','MCARE_SUBJ_CD','OPRTN_YN','ED_RC_TOT_AMT']]
df_I10

In [11]:
df_I10.isnull().sum()

MDCARE_STRT_DT      0
BTH_YYYY            0
OFIJ_TYPE         107
MCARE_SUBJ_CD       0
OPRTN_YN            0
ED_RC_TOT_AMT       0
dtype: int64

In [12]:
df_I10.dropna()

,MDCARE_STRT_DT,BTH_YYYY,OFIJ_TYPE,MCARE_SUBJ_CD,OPRTN_YN,ED_RC_TOT_AMT
0,20020710,1921LE,0,1,0,7570
1,20020805,1921LE,0,1,0,18160
2,20021017,1921LE,0,1,0,7570
3,20071008,1921LE,0,23,0,14200
4,20040312,1921LE,0,1,0,7310
...,...,...,...,...,...,...
4624,20051220,2005,0,1,0,9050
4625,20050614,2005,0,1,0,9050
4626,20050716,2005,0,1,0,9050
4627,20060123,2005,0,1,0,9380
4628,20101125,2005,0,1,0,12280

In [30]:
df_I10.to_csv('Join_Collection_NSC2_BND_M20.csv')